valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxDmu_bf.h
/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S78L */
#define IFX_DMU_HP_PROCON_P2_S78L_OFF (14u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S79L */
#define IFX_DMU_HP_PROCON_P2_S79L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S79L */
#define IFX_DMU_HP_PROCON_P2_S79L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S79L */
#define IFX_DMU_HP_PROCON_P2_S79L_OFF (15u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S80L */
#define IFX_DMU_HP_PROCON_P2_S80L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S80L */
#define IFX_DMU_HP_PROCON_P2_S80L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S80L */
#define IFX_DMU_HP_PROCON_P2_S80L_OFF (16u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S81L */
#define IFX_DMU_HP_PROCON_P2_S81L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S81L */
#define IFX_DMU_HP_PROCON_P2_S81L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S81L */
#define IFX_DMU_HP_PROCON_P2_S81L_OFF (17u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S82L */
#define IFX_DMU_HP_PROCON_P2_S82L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S82L */
#define IFX_DMU_HP_PROCON_P2_S82L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S82L */
#define IFX_DMU_HP_PROCON_P2_S82L_OFF (18u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S83L */
#define IFX_DMU_HP_PROCON_P2_S83L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S83L */
#define IFX_DMU_HP_PROCON_P2_S83L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S83L */
#define IFX_DMU_HP_PROCON_P2_S83L_OFF (19u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S84L */
#define IFX_DMU_HP_PROCON_P2_S84L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S84L */
#define IFX_DMU_HP_PROCON_P2_S84L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S84L */
#define IFX_DMU_HP_PROCON_P2_S84L_OFF (20u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S85L */
#define IFX_DMU_HP_PROCON_P2_S85L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S85L */
#define IFX_DMU_HP_PROCON_P2_S85L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S85L */
#define IFX_DMU_HP_PROCON_P2_S85L_OFF (21u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S86L */
#define IFX_DMU_HP_PROCON_P2_S86L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S86L */
#define IFX_DMU_HP_PROCON_P2_S86L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S86L */
#define IFX_DMU_HP_PROCON_P2_S86L_OFF (22u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S87L */
#define IFX_DMU_HP_PROCON_P2_S87L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S87L */
#define IFX_DMU_HP_PROCON_P2_S87L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S87L */
#define IFX_DMU_HP_PROCON_P2_S87L_OFF (23u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S88L */
#define IFX_DMU_HP_PROCON_P2_S88L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S88L */
#define IFX_DMU_HP_PROCON_P2_S88L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S88L */
#define IFX_DMU_HP_PROCON_P2_S88L_OFF (24u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S89L */
#define IFX_DMU_HP_PROCON_P2_S89L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S89L */
#define IFX_DMU_HP_PROCON_P2_S89L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S89L */
#define IFX_DMU_HP_PROCON_P2_S89L_OFF (25u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S90L */
#define IFX_DMU_HP_PROCON_P2_S90L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S90L */
#define IFX_DMU_HP_PROCON_P2_S90L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S90L */
#define IFX_DMU_HP_PROCON_P2_S90L_OFF (26u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S91L */
#define IFX_DMU_HP_PROCON_P2_S91L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S91L */
#define IFX_DMU_HP_PROCON_P2_S91L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S91L */
#define IFX_DMU_HP_PROCON_P2_S91L_OFF (27u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S92L */
#define IFX_DMU_HP_PROCON_P2_S92L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S92L */
#define IFX_DMU_HP_PROCON_P2_S92L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S92L */
#define IFX_DMU_HP_PROCON_P2_S92L_OFF (28u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S93L */
#define IFX_DMU_HP_PROCON_P2_S93L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S93L */
#define IFX_DMU_HP_PROCON_P2_S93L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S93L */
#define IFX_DMU_HP_PROCON_P2_S93L_OFF (29u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S94L */
#define IFX_DMU_HP_PROCON_P2_S94L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S94L */
#define IFX_DMU_HP_PROCON_P2_S94L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S94L */
#define IFX_DMU_HP_PROCON_P2_S94L_OFF (30u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S95L */
#define IFX_DMU_HP_PROCON_P2_S95L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S95L */
#define IFX_DMU_HP_PROCON_P2_S95L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S95L */
#define IFX_DMU_HP_PROCON_P2_S95L_OFF (31u)

/** \brief Length for Ifx_DMU_HP_PROCON_P3_Bits.S96L */
#define IFX_DMU_HP_PROCON_P3_S96L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P3_Bits.S96L */
#define IFX_DMU_HP_PROCON_P3_S96L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P3_Bits.S96L */
#define IFX_DMU_HP_PROCON_P3_S96L_OFF (0u)

/** \brief Length for Ifx_DMU_HP_PROCON_P3_Bits.S97L */
#define IFX_DMU_HP_PROCON_P3_S97L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P3_Bits.S97L */
#define IFX_DMU_HP_PROCON_P3_S97L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P3_Bits.S97L */
#define IFX_DMU_HP_PROCON_P3_S97L_OFF (1u)

/** \brief Length for Ifx_DMU_HP_PROCON_P3_Bits.S98L */
#define IFX_DMU_HP_PROCON_P3_S98L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P3_Bits.S98L */
#define IFX_DMU_HP_PROCON_P3_S98L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P3_Bits.S98L */
#define IFX_DMU_HP_PROCON_P3_S98L_OFF (2u)

/** \brief Length for Ifx_DMU_HP_PROCON_P3_Bits.S99L */
#define IFX_DMU_HP_PROCON_P3_S99L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P3_Bits.S99L */
#define IFX_DMU_HP_PROCON_P3_S99L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P3_Bits.S99L */
#define IFX_DMU_HP_PROCON_P3_S99L_OFF (3u)

/** \brief Length for Ifx_DMU_HP_PROCON_P3_Bits.S100L */
#define IFX_DMU_HP_PROCON_P3_S100L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P3_Bits.S100L */
#define IFX_DMU_HP_PROCON_P3_S100L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P3_Bits.S100L */
#define IFX_DMU_HP_PROCON_P3_S100L_OFF (4u)

/** \brief Length for Ifx_DMU_HP_PROCON_P3_Bits.S101L */
#define IFX_DMU_HP_PROCON_P3_S101L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P3_Bits.S101L */
#define IFX_DMU_HP_PROCON_P3_S101L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P3_Bits.S101L */
#define IFX_DMU_HP_PROCON_P3_S101L_OFF (5u)

/** \brief Length for Ifx_DMU_HP_PROCON_P3_Bits.S102L */
#define IFX_DMU_HP_PROCON_P3_S102L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P3_Bits.S102L */
#define IFX_DMU_HP_PROCON_P3_S102L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P3_Bits.S102L */
#define IFX_DMU_HP_PROCON_P3_S102L_OFF (6u)

/** \brief Length for Ifx_DMU_HP_PROCON_P3_Bits.S103L */
#define IFX_DMU_HP_PROCON_P3_S103L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P3_Bits.S103L */
#define IFX_DMU_HP_PROCON_P3_S103L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P3_Bits.S103L */
#define IFX_DMU_HP_PROCON_P3_S103L_OFF (7u)

/** \brief Length for Ifx_DMU_HP_PROCON_P3_Bits.S104L */
#define IFX_DMU_HP_PROCON_P3_S104L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P3_Bits.S104L */
#define IFX_DMU_HP_PROCON_P3_S104L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P3_Bits.S104L */
#define IFX_DMU_HP_PROCON_P3_S104L_OFF (8u)

/** \brief Length for Ifx_DMU_HP_PROCON_P3_Bits.S105L */
#define IFX_DMU_HP_PROCON_P3_S105L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P3_Bits.S105L */
#define IFX_DMU_HP_PROCON_P3_S105L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P3_Bits.S105L */
#define IFX_DMU_HP_PROCON_P3_S105L_OFF (9u)

/** \brief Length for Ifx_DMU_HP_PROCON_P3_Bits.S106L */
#define IFX_DMU_HP_PROCON_P3_S106L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P3_Bits.S106L */
#define IFX_DMU_HP_PROCON_P3_S106L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P3_Bits.S106L */
#define IFX_DMU_HP_PROCON_P3_S106L_OFF (10u)

/** \brief Length for Ifx_DMU_HP_PROCON_P3_Bits.S107L */
#define IFX_DMU_HP_PROCON_P3_S107L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P3_Bits.S107L */
#define IFX_DMU_HP_PROCON_P3_S107L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P3_Bits.S107L */
#define IFX_DMU_HP_PROCON_P3_S107L_OFF (11u)

