valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S122ROM */
#define IFX_DMU_HP_PROCON_OTP3_S122ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S122ROM */
#define IFX_DMU_HP_PROCON_OTP3_S122ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S122ROM */
#define IFX_DMU_HP_PROCON_OTP3_S122ROM_OFF (26u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S123ROM */
#define IFX_DMU_HP_PROCON_OTP3_S123ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S123ROM */
#define IFX_DMU_HP_PROCON_OTP3_S123ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S123ROM */
#define IFX_DMU_HP_PROCON_OTP3_S123ROM_OFF (27u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S124ROM */
#define IFX_DMU_HP_PROCON_OTP3_S124ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S124ROM */
#define IFX_DMU_HP_PROCON_OTP3_S124ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S124ROM */
#define IFX_DMU_HP_PROCON_OTP3_S124ROM_OFF (28u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S125ROM */
#define IFX_DMU_HP_PROCON_OTP3_S125ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S125ROM */
#define IFX_DMU_HP_PROCON_OTP3_S125ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S125ROM */
#define IFX_DMU_HP_PROCON_OTP3_S125ROM_OFF (29u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S126ROM */
#define IFX_DMU_HP_PROCON_OTP3_S126ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S126ROM */
#define IFX_DMU_HP_PROCON_OTP3_S126ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S126ROM */
#define IFX_DMU_HP_PROCON_OTP3_S126ROM_OFF (30u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S127ROM */
#define IFX_DMU_HP_PROCON_OTP3_S127ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S127ROM */
#define IFX_DMU_HP_PROCON_OTP3_S127ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S127ROM */
#define IFX_DMU_HP_PROCON_OTP3_S127ROM_OFF (31u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S128ROM */
#define IFX_DMU_HP_PROCON_OTP4_S128ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S128ROM */
#define IFX_DMU_HP_PROCON_OTP4_S128ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S128ROM */
#define IFX_DMU_HP_PROCON_OTP4_S128ROM_OFF (0u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S129ROM */
#define IFX_DMU_HP_PROCON_OTP4_S129ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S129ROM */
#define IFX_DMU_HP_PROCON_OTP4_S129ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S129ROM */
#define IFX_DMU_HP_PROCON_OTP4_S129ROM_OFF (1u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S130ROM */
#define IFX_DMU_HP_PROCON_OTP4_S130ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S130ROM */
#define IFX_DMU_HP_PROCON_OTP4_S130ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S130ROM */
#define IFX_DMU_HP_PROCON_OTP4_S130ROM_OFF (2u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S131ROM */
#define IFX_DMU_HP_PROCON_OTP4_S131ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S131ROM */
#define IFX_DMU_HP_PROCON_OTP4_S131ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S131ROM */
#define IFX_DMU_HP_PROCON_OTP4_S131ROM_OFF (3u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S132ROM */
#define IFX_DMU_HP_PROCON_OTP4_S132ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S132ROM */
#define IFX_DMU_HP_PROCON_OTP4_S132ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S132ROM */
#define IFX_DMU_HP_PROCON_OTP4_S132ROM_OFF (4u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S133ROM */
#define IFX_DMU_HP_PROCON_OTP4_S133ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S133ROM */
#define IFX_DMU_HP_PROCON_OTP4_S133ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S133ROM */
#define IFX_DMU_HP_PROCON_OTP4_S133ROM_OFF (5u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S134ROM */
#define IFX_DMU_HP_PROCON_OTP4_S134ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S134ROM */
#define IFX_DMU_HP_PROCON_OTP4_S134ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S134ROM */
#define IFX_DMU_HP_PROCON_OTP4_S134ROM_OFF (6u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S135ROM */
#define IFX_DMU_HP_PROCON_OTP4_S135ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S135ROM */
#define IFX_DMU_HP_PROCON_OTP4_S135ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S135ROM */
#define IFX_DMU_HP_PROCON_OTP4_S135ROM_OFF (7u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S136ROM */
#define IFX_DMU_HP_PROCON_OTP4_S136ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S136ROM */
#define IFX_DMU_HP_PROCON_OTP4_S136ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S136ROM */
#define IFX_DMU_HP_PROCON_OTP4_S136ROM_OFF (8u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S137ROM */
#define IFX_DMU_HP_PROCON_OTP4_S137ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S137ROM */
#define IFX_DMU_HP_PROCON_OTP4_S137ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S137ROM */
#define IFX_DMU_HP_PROCON_OTP4_S137ROM_OFF (9u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S138ROM */
#define IFX_DMU_HP_PROCON_OTP4_S138ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S138ROM */
#define IFX_DMU_HP_PROCON_OTP4_S138ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S138ROM */
#define IFX_DMU_HP_PROCON_OTP4_S138ROM_OFF (10u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S139ROM */
#define IFX_DMU_HP_PROCON_OTP4_S139ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S139ROM */
#define IFX_DMU_HP_PROCON_OTP4_S139ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S139ROM */
#define IFX_DMU_HP_PROCON_OTP4_S139ROM_OFF (11u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S140ROM */
#define IFX_DMU_HP_PROCON_OTP4_S140ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S140ROM */
#define IFX_DMU_HP_PROCON_OTP4_S140ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S140ROM */
#define IFX_DMU_HP_PROCON_OTP4_S140ROM_OFF (12u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S141ROM */
#define IFX_DMU_HP_PROCON_OTP4_S141ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S141ROM */
#define IFX_DMU_HP_PROCON_OTP4_S141ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S141ROM */
#define IFX_DMU_HP_PROCON_OTP4_S141ROM_OFF (13u)

