valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxDmu_bf.h
/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S150WOP */
#define IFX_DMU_HP_PROCON_WOP4_S150WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S150WOP */
#define IFX_DMU_HP_PROCON_WOP4_S150WOP_OFF (22u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S151WOP */
#define IFX_DMU_HP_PROCON_WOP4_S151WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S151WOP */
#define IFX_DMU_HP_PROCON_WOP4_S151WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S151WOP */
#define IFX_DMU_HP_PROCON_WOP4_S151WOP_OFF (23u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S152WOP */
#define IFX_DMU_HP_PROCON_WOP4_S152WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S152WOP */
#define IFX_DMU_HP_PROCON_WOP4_S152WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S152WOP */
#define IFX_DMU_HP_PROCON_WOP4_S152WOP_OFF (24u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S153WOP */
#define IFX_DMU_HP_PROCON_WOP4_S153WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S153WOP */
#define IFX_DMU_HP_PROCON_WOP4_S153WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S153WOP */
#define IFX_DMU_HP_PROCON_WOP4_S153WOP_OFF (25u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S154WOP */
#define IFX_DMU_HP_PROCON_WOP4_S154WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S154WOP */
#define IFX_DMU_HP_PROCON_WOP4_S154WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S154WOP */
#define IFX_DMU_HP_PROCON_WOP4_S154WOP_OFF (26u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S155WOP */
#define IFX_DMU_HP_PROCON_WOP4_S155WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S155WOP */
#define IFX_DMU_HP_PROCON_WOP4_S155WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S155WOP */
#define IFX_DMU_HP_PROCON_WOP4_S155WOP_OFF (27u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S156WOP */
#define IFX_DMU_HP_PROCON_WOP4_S156WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S156WOP */
#define IFX_DMU_HP_PROCON_WOP4_S156WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S156WOP */
#define IFX_DMU_HP_PROCON_WOP4_S156WOP_OFF (28u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S157WOP */
#define IFX_DMU_HP_PROCON_WOP4_S157WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S157WOP */
#define IFX_DMU_HP_PROCON_WOP4_S157WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S157WOP */
#define IFX_DMU_HP_PROCON_WOP4_S157WOP_OFF (29u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S158WOP */
#define IFX_DMU_HP_PROCON_WOP4_S158WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S158WOP */
#define IFX_DMU_HP_PROCON_WOP4_S158WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S158WOP */
#define IFX_DMU_HP_PROCON_WOP4_S158WOP_OFF (30u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S159WOP */
#define IFX_DMU_HP_PROCON_WOP4_S159WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S159WOP */
#define IFX_DMU_HP_PROCON_WOP4_S159WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S159WOP */
#define IFX_DMU_HP_PROCON_WOP4_S159WOP_OFF (31u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S160WOP */
#define IFX_DMU_HP_PROCON_WOP5_S160WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S160WOP */
#define IFX_DMU_HP_PROCON_WOP5_S160WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S160WOP */
#define IFX_DMU_HP_PROCON_WOP5_S160WOP_OFF (0u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S161WOP */
#define IFX_DMU_HP_PROCON_WOP5_S161WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S161WOP */
#define IFX_DMU_HP_PROCON_WOP5_S161WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S161WOP */
#define IFX_DMU_HP_PROCON_WOP5_S161WOP_OFF (1u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S162WOP */
#define IFX_DMU_HP_PROCON_WOP5_S162WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S162WOP */
#define IFX_DMU_HP_PROCON_WOP5_S162WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S162WOP */
#define IFX_DMU_HP_PROCON_WOP5_S162WOP_OFF (2u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S163WOP */
#define IFX_DMU_HP_PROCON_WOP5_S163WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S163WOP */
#define IFX_DMU_HP_PROCON_WOP5_S163WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S163WOP */
#define IFX_DMU_HP_PROCON_WOP5_S163WOP_OFF (3u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S164WOP */
#define IFX_DMU_HP_PROCON_WOP5_S164WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S164WOP */
#define IFX_DMU_HP_PROCON_WOP5_S164WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S164WOP */
#define IFX_DMU_HP_PROCON_WOP5_S164WOP_OFF (4u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S165WOP */
#define IFX_DMU_HP_PROCON_WOP5_S165WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S165WOP */
#define IFX_DMU_HP_PROCON_WOP5_S165WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S165WOP */
#define IFX_DMU_HP_PROCON_WOP5_S165WOP_OFF (5u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S166WOP */
#define IFX_DMU_HP_PROCON_WOP5_S166WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S166WOP */
#define IFX_DMU_HP_PROCON_WOP5_S166WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S166WOP */
#define IFX_DMU_HP_PROCON_WOP5_S166WOP_OFF (6u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S167WOP */
#define IFX_DMU_HP_PROCON_WOP5_S167WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S167WOP */
#define IFX_DMU_HP_PROCON_WOP5_S167WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S167WOP */
#define IFX_DMU_HP_PROCON_WOP5_S167WOP_OFF (7u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S168WOP */
#define IFX_DMU_HP_PROCON_WOP5_S168WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S168WOP */
#define IFX_DMU_HP_PROCON_WOP5_S168WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S168WOP */
#define IFX_DMU_HP_PROCON_WOP5_S168WOP_OFF (8u)

