valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxDmu_bf.h
/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM36X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM36X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM36X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM36X_OFF (4u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM37X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM37X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM37X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM37X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM37X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM37X_OFF (5u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM38X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM38X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM38X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM38X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM38X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM38X_OFF (6u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM39X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM39X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM39X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM39X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM39X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM39X_OFF (7u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM0ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM0ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM0ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM0ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM0ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM0ROM_OFF (0u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM1ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM1ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM1ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM1ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM1ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM1ROM_OFF (1u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM2ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM2ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM2ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM2ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM2ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM2ROM_OFF (2u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM3ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM3ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM3ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM3ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM3ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM3ROM_OFF (3u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM4ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM4ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM4ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM4ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM4ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM4ROM_OFF (4u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM5ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM5ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM5ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM5ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM5ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM5ROM_OFF (5u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM6ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM6ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM6ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM6ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM6ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM6ROM_OFF (6u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM7ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM7ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM7ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM7ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM7ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM7ROM_OFF (7u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM8ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM8ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM8ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM8ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM8ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM8ROM_OFF (8u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM9ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM9ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM9ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM9ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM9ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM9ROM_OFF (9u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM10ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM10ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM10ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM10ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM10ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM10ROM_OFF (10u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM11ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM11ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM11ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM11ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM11ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM11ROM_OFF (11u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM12ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM12ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM12ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM12ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM12ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM12ROM_OFF (12u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM13ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM13ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM13ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM13ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM13ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM13ROM_OFF (13u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM14ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM14ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM14ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM14ROM_MSK (0x1u)

